[
  {
    "position": "Software Automation Engineer",
    "startDate": "Oct 2020",
    "endDate": "Current",
    "location": "Columbus, OH",
    "employer": "Olive",
    "description": "",
    "bulletPoints": [
      "Develop Robotic Process automations for customers in the healthcare industry.", 
      "Use Node JS, Axios, and Puppeteer to navigate through insurance web portals to automatically collect data.",
      "Utilize a proprietary, in-house IDE built upon Javascript and Selenium to create custom web automations.",
      "Lead new initiatives on the team for increasing performance of data collection through usage of backend APIs on websites, as opposed to traditional web-based data-scraping."
    ],
    "image": "/assets/images/olive.jfif"
  },
  {
    "position": "IT Application Developer",
    "startDate": "Jun 2019",
    "endDate": "Sept 2020",
    "location": "Columbus, OH",
    "employer": "Nationwide",
    "description": "",
    "bulletPoints": [
      "Maintain and extend large pre-existing code bases in AngularJS, Angular 7, and Java.",
      "Develop responsive, robust, and optimized web pages capable of integrating and presenting multiple data sources.",
      "Migrate legacy code from AngularJS to Angular 7.",
      "Cooperate in an agile team to deliver coordinated solutions for business needs. ",
      "Leverage tools such as Jenkins and Concourse for CI/CD.",
      "Utilize New Relic and Contrast for monitoring capabilities."
    ],
    "image": "/assets/images/nw.jfif",
    "links": [
      {
        "title": "Mutual funds page redesign and modernization",
        "url": "https://nationwidefinancial.com/products/investments/mutual-funds/fund-list/fund-details/NWAGX",
        "explanation": "A project at Nationwide in which I was allowed to lead. We created a reusable Angular 7 library that could be used on 3 sites while maintaining the same styling and functionality."
      }
    ]
  },
  {
    "position": "President / Founder",
    "startDate": "Sep 2017",
    "endDate": "May 2019",
    "location": "Bowling Green, OH",
    "employer": "Falcon eSports (BGSU Student Org)",
    "description": "",
    "bulletPoints": [
      "Organized and operated weekly competitive gaming events on campus.",
      "Delegated responsibilities amongst cabinet members to represent different gaming communities and organize new events for the students.",
      "Coordinated with local schools to create inter-collegiate competitions.",
      "Developed promotional materials such as posters, fliers, stream overlays and online advertisements for events."
    ],
    "image": "/assets/images/bgesports.png"
  },
  {
    "position": "Test Automation Developer Intern",
    "startDate": "May 2018",
    "endDate": "Aug 2018",
    "location": "Columbus, OH",
    "employer": "Nationwide",
    "description": "",
    "bulletPoints": [
      "Worked in an existing test automation code base for SOAP and REST web services for enterprise customer information files.",
      "Developed new tests in Gherkin format from the ground-up to cover more test cases."
    ],
    "image": "/assets/images/nw.jfif"
  },
  {
    "position": "Software Developer Intern",
    "startDate": "May 2017",
    "endDate": "Aug 2017",
    "location": "Columbus, OH",
    "employer": "Nationwide",
    "description": "",
    "bulletPoints": [
      "Adapted legacy systems into modern programming paradigms.",
      "Ensured the quality of software that was actively shipped to customers in personal lines."
    ],
    "image": "/assets/images/nw.jfif"
  },
  {
    "position": "Take-Out-Specialist",
    "startDate": "April 2015",
    "endDate": "Jan 2017",
    "location": "Louisville, KY",
    "employer": "Chipotle Mexican Grill",
    "description": "",
    "bulletPoints": [
      "Increase online and catering sales through marketing techniques, promotions, and great customer service",
      "Ensure proper functioning of restaurant through communication between managers and crew members",
      "Provide leadership on front line operations during peak restaurant hours",
      "Train newly hired employees to achieve high standards"
    ],
    "image": "/assets/images/cmg.png"
  }
]
